{
  "date": "2020-07-15T07:27:23.996Z",
  "title": "We need to stop entertaining our kids",
  "description": " Should we be packing our kid’s calendars with activities or replicating our own childhood fun? We investigate....",
  "body": "Horse riding on a soggy Sunday morning was my childhood ritual. It sounds quite fancy I know, but my family didn’t own the pony and certainly not the stable, but from the age of seven, I could be found trotting around in a circle in a damp field in the south of England.\n\nIt was the one, yep one, activity I took part in as a kid. My brothers went off to Sunday soccer and I sat nervously on Jasmine, the slightly overweight Shetland pony, praying that the instructor wouldn’t include jumping as part of the lesson that day.\n\nI was incredibly proud to have a hobby and while I wasn’t keen on getting heavily involved with the saddling and grooming, I liked to talk to my friends about my weekend pony rides. My parents were always very clear about ‘seeing things through’, so once I’d settled on riding Jasmine there was no going back.\n\nNow that I’m a mum I inevitably compare my childhood to that of my own kids. “What did you do on the weekend when you were a kid mum?” they ask and when I rattle off the types of activities I did they glaze over - it all sounds so foreign to them.\n\nI regale them with stories of playing for hours out on the street with the neighbour’s kids, how we used to play with marbles or simply just do handstands until we were called in for dinner. Trips out included the supermarket and if we were really lucky, lunch at a burger place, but never the crazy packed schedule they adhere to over an average week.\n\nWe’ve tried the lot. We’ve flapped and flounced at ballet class, invested in outrageously expensive tap-dancing shoes, followed a passion for musical theatre, cheered on backhands and forehands, applauded goals (soccer and AFL no less), endured/enjoyed endless flute recitals, learnt the rules of Teeball, encouraged coding and winced during complicated cheerleading routines."
}